import { BooksUserPreferences } from "./booksRecommendations-types";

export const moodOptions = [
  "Развълнуван/-на 😄",
  "Любопитен/-на 🤔",
  "Тъжен/-на 😢",
  "Щастлив/-а 😊",
  "Спокоен/-йна 😌",
  "Разочарован/-на 😞",
  "Уморен/-на 😴",
  "Нервен/-на 😟",
  "Разгневен/-на 😠",
  "Стресиран/-на 😰",
  "Носталгичен/-на 😭",
  "Безразличен/-на 😐",
  "Оптимистичен/-на 😃",
  "Песимистичен/-на 😔",
  "Весел/-а 😁",
  "Смутен/-на 😳",
  "Озадачен/-на 🤨",
  "Разтревожен/-на 😧",
  "Вдъхновен/-на ✨"
];

export const pacingOptions = [
  "Бавни, концентриращи се върху разкази на героите",
  "Бързи с много напрежение",
  "Нямам предпочитания"
];
export const depthOptions = [
  "Лесни за проследяване - релаксиращи",
  "Средни - с ясни сюжетни линии",
  "Трудни - с много истории и терминологии, характерни за книгата",
  "Нямам предпочитания"
];

export const targetGroupOptions = [
  "Деца",
  "Тийнейджъри",
  "Възрастни",
  "Семейни",
  "Семейство и деца",
  "Възрастни над 65"
];

export const googleBooksPrompt = (userPreferences: BooksUserPreferences) => {
  const genres = userPreferences.genres.map((genre) => genre.en).join(", ");
  return {
    model: "gpt-4-turbo",
    messages: [
      {
        role: "system",
        content:
          "Ти си изкуствен интелект, който препоръчва книги САМО В Google Books и събира подробна информация за всяка една от тях. Цялата информация трябва да бъде представена в правилен JSON формат с всички стойности преведени на български език, като заглавието на изданието трябва да бъде точно и реално. Книгите не трябва да са измислени, а в действителност да съществуват."
      },
      {
        role: "user",
        content: `Книгите трябва да съответстват на следните лични предпочитания: Любими жанрове: [${genres}]; Емоционално състояние: [${userPreferences.moods}]; Любими автори: [${userPreferences.authors}]; Теми, които ме интересуват: [${userPreferences.interests}]; Произход: [${userPreferences.origin}]; Целева група: [${userPreferences.targetGroup}]; Предпочитам книги, които са ${userPreferences.pacing}. Нивото на задълбочаване на книгите трябва да бъде: [${userPreferences.depth}]. Съобрази се максимално с дадените предпочитания, но се фокусирай главно върху точността и съществуването на препоръчваните книги`
      },
      {
        role: "user",
        content:
          "Събери подробна информация от Google Books и представи данните в следния JSON формат: [{'title_en': string, 'title_bg': string, 'real_edition_title': string, 'origin': string, 'reason': string, 'adaptations': string, 'goodreads_rating': number}, {още 4 препоръки...}]. Обектът трябва да бъде валиден за JavaScript JSON.parse() функцията. Полето \"origin\" описва произхода на книгата по региони, например: 'Руска литература', 'Българска литература', 'Европейска литература' и т.н. В полето \"reason\" трябва да се даде отговор на въпроса: 'Защо тази книга е подходяща за мен?' спрямо предпочитанията, които са посочени. Полето \"real_edition_title\" трябва да съдържа пълното заглавие на изданието точно както е в Google Books, което ще бъде използвано за директно търсене в следния формат: 'точно име - автор - Google Books'. Освен това, точното име и автора в \"real_edition_title\" трябва задължително да са на родния език на автора, например: при английски автор като Arthur C. Clarke, името на произведението също трябва да бъде в английски, при български автор - името на произведението трябва да е на български и т.н. Включи адаптации на книгите (ако има такива), като филми, сериали или театрални постановки, посочвайки имената на адаптациите и годините на издаване/представяне. Всички текстови стойности, включително заглавия, автори, описания, жанрове и произход, трябва да бъдат преведени на български език. Отговори само с валиден JSON обект без допълнителен текст или обяснения."
      }
    ]
  };
};

export const goodreadsPrompt = (userPreferences: BooksUserPreferences) => {
  const genres = userPreferences.genres.map((genre) => genre.en).join(", ");
  return {
    model: "gpt-4-turbo",
    messages: [
      {
        role: "system",
        content:
          "You are an AI that recommends books based on the user's preferences. You must recommend books that exist on Goodreads, ensuring that all titles and details correspond to real entries from Goodreads. Inventing books or providing fictional information is absolutely prohibited. Не е задължително всяка книга да отговаря на всички лични предпочитания, но е препоръчително всяко предпочитание да е изпълнено чрез поне една книга. Препоръчително е да изпълняваш предпочитанията на потребителя, но ако не намираш достатъчно книги, отговарящи на тях - можеш да се отклониш от някое стига да се изпълнява друго (пример: предпочитана държава на произход България не значи, че книгите трябва да са само български, но е препоръчително да са предимно такива; предпочитан жанр драма не значи, че книгите трябва да са само драматични, но е препоръчително да са предимно такива). Препоръчително е да предложиш 5 книги, но в крайни ситуации, в които нямаш предложение не измисляй свои заглавия - по-добре е да предложиш нещо което не отговаря до такава степен на някое предпочитание. Не препоръчвай само популярни или известни книги - нека има разнообразие. Не препоръчвай една книга повече от веднъж на резултат."
      },
      {
        role: "user",
        content: `Обърни внимание на следните лични предпочитания: Любими жанрове: [[${genres}]; Емоционално състояние: [${userPreferences.moods}]; Любими автори: [${userPreferences.authors}]; Предпочитан регион на произход: [${userPreferences.origin}]; Теми, които ме интересуват: [${userPreferences.interests}]; Целева група: [${userPreferences.targetGroup}]; Предпочитам книги, които са ${userPreferences.pacing}. Нивото на задълбочаване на книгите трябва да бъде: [${userPreferences.depth}].`
      },
      {
        role: "user",
        content:
          "Събери подробна информация от Goodreads и представи данните в следния JSON формат: [{'title_en': string, 'title_bg': string, 'real_edition_title': 'точно име - автор - Goodreads', 'origin': string, 'reason': string, 'adaptations': string}, {още 4 препоръки...}]. Обектът трябва да бъде валиден за JavaScript JSON.parse() функцията. Полето \"origin\" описва произхода на книгата по региони, например: 'Руска литература', 'Българска литература', 'Европейска литература' и т.н. В полето \"reason\" трябва да се даде отговор на въпроса: 'Защо тази книга е подходяща за мен?' спрямо предпочитанията, които са посочени. Полето \"real_edition_title\" трябва да съдържа точното и пълното заглавие на изданието точно както е в Goodreads, което ще бъде използвано за директно търсене. Включи адаптации на книгите (ако има такива), като филми, сериали или театрални постановки, посочвайки имената на адаптациите и годините на издаване/представяне. Всички текстови стойности, включително заглавия, автори, описания, жанрове и произход, трябва да бъдат преведени на български език. Отговори само с валиден JSON обект без допълнителен текст или обяснения."
      }
    ]
  };
};
