import { FilteredBrainData } from "@/container/types_common";
import { MusicUserPreferences } from "./musicRecommendations-types";

export const moodOptions = [
  "Развълнуван/-на 😄",
  "Любопитен/-на 🤔",
  "Тъжен/-на 😢",
  "Щастлив/-а 😊",
  "Спокоен/-йна 😌",
  "Разочарован/-на 😞",
  "Уморен/-на 😴",
  "Нервен/-на 😟",
  "Разгневен/-на 😠",
  "Стресиран/-на 😰",
  "Носталгичен/-на 😭",
  "Безразличен/-на 😐",
  "Оптимистичен/-на 😃",
  "Песимистичен/-на 😔",
  "Весел/-а 😁",
  "Смутен/-на 😳",
  "Озадачен/-на 🤨",
  "Разтревожен/-на 😧",
  "Вдъхновен/-на ✨"
];

export const ageOptions = [
  "Публикувана в последните 3 години",
  "Публикувана в последните 10 години",
  "Публикувана в последните 20 години",
  "Нямам предпочитания"
];

export const pacingOptions = [
  "Бавно и отпускащо",
  "Умерено и балансирано",
  "Бързо и енергично",
  "Нямам предпочитания"
];

export const depthOptions = [
  "Леки – без ангажиращи текстове, просто за настроение",
  "Средна дълбочина – с послание, но лесни за възприемане",
  "Дълбоки – с емоционални теми, метафори и концепции",
  "Нямам предпочитания"
];

export const targetGroupOptions = [
  "Деца",
  "Тийнейджъри",
  "Възрастни",
  "Семейни",
  "Семейство и деца",
  "Възрастни над 65"
];

export const openAIKey = import.meta.env.VITE_OPENAI_API_KEY;

export const musicStandardPreferencesPrompt = (
  userPreferences: MusicUserPreferences
) => {
  const {
    genres,
    moods,
    age,
    artists,
    producers,
    interests,
    countries,
    pacing,
    depth,
    targetGroup
  } = userPreferences;

  return {
    model: "gpt-4.1-2025-04-14",
    messages: [
      {
        role: "system",
        content: `You are an AI that recommends music based on user preferences. Only suggest REAL, existing songs and artists. Do not invent songs. Ensure all songs can be found on YouTube or Spotify. Return a valid JSON response formatted in Bulgarian, with justifications.`
      },
      {
        role: "user",
        content: `Препоръчай ми 5 песни за слушане, които ЗАДЪЛЖИТЕЛНО да съвпадат с моите вкусове и предпочитания, а именно:
              Любими жанрове: ${genres.map((genre) => genre.en).join(", ")}.
              Емоционално състояние в този момент: ${moods}.
              Възрастта на песните задължително да бъде: ${age}.
              Любими изпълнители: ${artists}.
              Любими музикални продуценти: ${producers}.
              Теми, които ме интересуват в музиката: ${interests}.
              Песните могат да бъдат от следните страни: ${countries}.
              Темпото на песните предпочитам да бъде: ${pacing}.
              Предпочитам нивото на задълбочаване на песните да е: ${depth}.
              Целевата група е: ${targetGroup}.
              Дай информация за всяка песен поотделно защо тя е подходяща за мен.
              Форматирай своя response във валиден JSON формат по този начин:
              {
                'Официално име на песента на английски, както е прието да бъде': {
                  'artist': 'Име на изпълнителя или групата, като всички участници са разделени със запетая. Не използвай "ft.", "feat.", "x", "&", "and" и др. – винаги използвай само запетая. Примери: "Bad Bunny, Jhay Cortez" или "MEDUZA, Goodboys".',
                  'description': 'Описание на песента',
                  'reason': 'Защо тази песен е подходящ за мен?'
                },
                'Официално име на песента на английски, както е прието да бъде': {
                  'artist': 'Име на изпълнителя или групата, като всички участници са разделени със запетая. Не използвай "ft.", "feat.", "x", "&", "and" и др. – винаги използвай само запетая. Примери: "Bad Bunny, Jhay Cortez" или "MEDUZA, Goodboys".',
                  'description': 'Описание на песента',
                  'reason': 'Защо тази песен е подходящ за мен?'
                },
                // ...още песни
              }. Не добавяй излишни думи или скоби. Избягвай вложени двойни или единични кавички (кавички от един тип едно в друго, които да дават грешки на JSON.parse функцията). 
              Увери се, че всички данни са правилно escape-нати, за да не предизвикат грешки в JSON формата. JSON форматът трябва да бъде напълно валиден за JavaScript JSON.parse() функцията.`
      }
    ]
  };
};

export const musicBrainAnalysisPrompt = (
  brainWaveData: FilteredBrainData[]
) => {
  const brainWaveString = JSON.stringify(brainWaveData, null, 2);

  return {
    model: "gpt-4o-2024-08-06",
    messages: [
      {
        role: "system",
        content: `You are an AI that recommends movies and series based on data from the 'NeuroSky MindWave Mobile 2: EEG Sensor'. The device provides insights into the user's brain activity, cognitive state and emotional levels by measuring EEG power spectrums (Delta, Theta, low and high Alpha, low and high Beta, low and high Gamma) and using data from EEG algorithms - Attention and Mediation. Relying on this data, provide a list of movies and series, formatted in Bulgarian, with detailed justifications. Return the result in JSON format as instructed.`
      },
      {
        role: "user",
        content: `Препоръчай ми 5 филма или сериала за гледане, които ЗАДЪЛЖИТЕЛНО да съвпадат с получените данни за мозъчна активност, а именно:
          ${brainWaveString}.
          Подсигури подробна информация за всеки отделен филм/сериал по отделно защо той е подходящ за мен НА БАЗА ДАННИТЕ ЗА МОЗЪЧНА АКТИВНОСТ.
          Задължително искам имената на филмите/сериалите да бъдат абсолютно точно както са официално на български език – така, както са известни сред публиката в България.
          Не се допуска буквален превод на заглавията от английски, ако официалното българско заглавие се различава от буквалния превод.
          Не препоръчвай 18+ филми/сериали.
          Форматирай своя response във валиден JSON формат по този начин като използваш само двойни кавички:
          {
            'Официално име на филма или сериала на английски, както е прието да бъде': {
              'bgName': 'Официално име на филма или сериала на български, както е прието да бъде, а не буквален превод',
              'description': 'Описание на филма или сериала',
              'reason': 'Защо този филм/сериал е подходящ за мен, според данните от устройството?'
            },
            'Официално име на филма или сериала на английски, както е прието да бъде': {
              'bgName': 'Официално име на филма или сериала на български, както е прието да бъде, а не буквален превод',
              'description': 'Описание на филма или сериала',
              'reason': 'Защо този филм/сериал е подходящ за мен, според данните от устройството?'
            }
          }`
      }
    ]
  };
};
